Revit 2026 API

# FamilyInstanceFromRoom Property

---

The "From Room" set for the door or window in the last phase of the project.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Room FromRoom { get; }
```
```vb
Public ReadOnly Property FromRoom As Room
	Get
```
```cpp
public:
property Room^ FromRoom {
	Room^ get ();
}
```
```fsharp
member FromRoom : Room with get
```

#### Property Value

RoomThe "From Room" set for the door or window in the last phase of the project.  if the FamilyInstance is neither a door nor a window, or if the door or window leads to a space where there is no room (an exterior space or interior space with no room defined). Also  if there is no target room assigned to the last phase, or phase does not apply to this FamilyInstance.

Revit automatically calculates the "From Room" for a given door or window. This is the default shown when creating a door or window schedule and adding the "From Room" properties. The user can opt to swap the "From Room" and "To Room" values via the schedule if they choose. The method FlipFromToRoom also can be used to swap the values.

#### Reference

FamilyInstance Class

FromRoom Overload

Autodesk.Revit.DB Namespace